# 1) მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'

num = int(input("Enter a number: "))

if num > 0:
    print("ეს რიცხვი დადებითი რიცხვია")
elif num == 0:
    print("ეს რიცხვი ნულია")
else:
    print("ეს რიცხვი უარყოფითი რიცხვია")


# # 2) მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# # 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# # 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# # 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# # 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# # 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# # თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'

age = int(input("Enter your age: "))

if age >= 0 and age <=12:
    print("ბავშვი ხარ")
elif age >= 13 and age <=19:
    print("მოზარდი/თინეიჯერი ხარ")
elif age >=20 and age <=64:
    print("ზრდასრული ხართ")
elif age >=65 and age <=120:
    print("ხანში შესული ხართ")
elif age > 120:
    print("გურუ ან ჯადოქარი")
else:
    print("არასწორი ინფო")

# 3) დაწერეთ "password guesser" პროგრამა, შექმენით რაიმე ცვლადი და მასში შეინახეთ ის პაროლი რომელსაც ყველგან იყენებთ ;)
# მომხმარებელს მოთხოვეთ გამოიცნოს თქვენი პაროლი
# აღნიშნეთ ცდების რაოდენობა
# გამოიყენეთ while loop, მანამ ატრიალეთ სანამ მომხმარებელი პაროლს არ გამოიცნობს ან დაწერს --> 'nah strong password'
# ბოლოს აჩვენეთ(დაუპრინტეთ) რამდენი ცდა დაჭირდა პაროლის გამოსაცნობად

password = "everlong666"
tries = 0

guess = input("Enter the password: ")

while guess != password:
    tries = tries + 1
    print("Tries: " + str(tries))
    guess = input("Enter the password: ")
    if guess == "nah strong password":
        print("You gave up at " + str(tries) + " tries.")
        break
    elif guess == password:
        print("It took you " + str(tries) + " tries.")
        break

        
# 4) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი

num2 = int(input("Enter a number: "))
num3 = int(input("Enter another number: "))
num4 = int(input("Enter one more number: "))

if num2 > num3 and num2 > num4:
    print(num2)
elif num3 > num2 and num3 > num4:
    print(num3)
elif num4 > num2 and num4 > num3:
    print(num4)

# 5) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'

num5 = int(input("Enter a number: "))
if num5 == 1:
    print("ორშაბათი")
elif num5 == 2:
    print("სამშაბათი")
elif num5 == 3:
    print("ოთხშაბათი")
elif num5 == 4:
    print("ხუთშაბათი")
elif num5 == 5:
    print("პარასკევი")
elif num5 == 6:
    print("შაბათი")
elif num5 == 7:
    print("კვირა")
else:
    print("არ ვიცი ეგ რა დღეა")
