# 1)შექმენი ფუნქცია, რომელსაც აქვს ერთი პარამეტრი —name.
# ფუნქციამ უნდა დააბრუნოს ტექსტი:
# გამარჯობა, [სახელი]!

# ფუნქცია გამოიძახე სხვადასხვა არგუმენტით მინიმუმ 3-ჯერ.


def name(სახელი):
    print("გამარჯობა" , სახელი)
    
    
print(name("saxeli1"))
print(name("saxeli2"))
print(name("saxeli3"))


# 2)შექმენი ფუნქცია, რომელსაც აქვს ორი პარამეტრი — num1 და num2.
# ფუნქციამ უნდა დააბრუნოს მათი ჯამი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def numbers(num1 , num2):
    print(num1 + num2)

print(numbers(3 , 6))
print(numbers(80 , 8))
print(numbers(24 , 3))



# 3)შექმენი ფუნქცია ერთი პარამეტრით num.

# ფუნქციამ უნდა დააბრუნოს (return) გადაცემული რიცხვის კვადრატი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def number(num):
    return(num**2)

print(number(3))
print(number(4))
print(number(5))

# 4)შექმენი ფუნქცია ერთი პარამეტრით — age.

# თუ ასაკი არის 18 ან მეტი, დააბრუნოს:
# სრულწლოვანი ხარ

# სხვა შემთხვევაში:
# არ ხარ სრულწლოვანი

def age(age):
    if age >= 18:
        return("სრულწლოვანი ხარ")
    else:
        return("არ ხარ სრულწლოვანი")
    
print(age(18))
print(age(23))
print(age(11))

# 5)შექმენი ფუნქცია ერთი პარამეტრით — (string).

# ფუნქციამ უნდა დაბეჭდოს ტექსტის სიმბოლოების რაოდენობა.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def strin(string):
    print(len(string))
    
print(strin("sdkjfh"))
print(strin("ajslfosb"))
print(strin("avm"))

# 6)შექმენი ფუნქცია ორი პარამეტრით num1 და nuk2.

# ფუნქციამ უნდა დააბრუნოს მათი ნამრავლი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def numbers(num1 , num2):
    print(num1*num2)
    
print(numbers(8 , 4))
print(numbers(2 , 3))
print(numbers(10 , 9))

# 7)შექმენი ფუნქცია ერთი პარამეტრით — score.

# თუ ქულა ≥ 90 → დააბრუნოს "შესანიშნავი ქულა"

# თუ ქულა >= 70 და ნაკლებია ან <=89 → დააბრუნოს "კარგი ქულა"

# თუ ქულა >= 50 და <= 69 → დააბრუნოს "დამაკმაყოფილებელი ქულა"

# სხვა შემთხვევაში დააბრუნოს "ჩაჭრილი"

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def scr(score):
    if score >= 90:
        print("შესანიშნავი ქულა")
    elif score >= 70 and score <= 89:
        print("კარგი ქულა")
    elif score >= 50 and score <= 69:
        print("დამაკმაყოფილებელი ქულა")
    else:
        print("ჩაჭრილი")


print(scr(100))
print(scr(88))
print(scr(41))
print(scr(13))
print(scr(57))
print(scr(66))

# 8)შექმენი ფუნქცია ერთი პარამეტრით — number.

# ფუნქციამ უნდა დააბრუნოს, ლუწია თუ კენტი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def num(number):
    if number % 2 == 0:
        print("even")
    elif number % 2 == 1:
        print("odd")
        
print(num(5))
print(num(8))
print(num(3))
print(num(7))
print(num(2))
print(num(4))

# 9)შექმენი ფუნქცია ერთი პარამეტრით — name

# ფუნქციამ უნდა დააბრუნოს მხოლოდ პირველი ასო.

# მაგალითად:
# „Giorgi“ → G

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def nm(name):
    print(name[0])
    
print(nm("Fsjhk"))
print(nm("Sdfshkj"))
print(nm("Pkfjsdh"))
print(nm("CXvcmnb"))


# 10)შექმენი ფუნქცია სამი num1 num2 num3.

# ფუნქციამ უნდა დააბრუნოს ამ სამი რიცხვის საშუალო არითმეტიკული.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def thr(num1 , num2, num3):
    print(num1 + num2 + num3 / 3)
    
print(thr(5, 8 , 9))
print(thr(3, 4 , 15))
print(thr(7, 90 , 18))
print(thr(11, 31 , 42))
