# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.  
# -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
# -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

# word = input("Enter a word: ")
# print(len(word))

# for i in range(len(word)):
#     print(word[i])

# 2)  შექმენით სია სადაც შეინახავთ სტრინგებს.
# დაუარეთ სიის თითოეულ ელემენტს:
# 1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა
# 2. თუ სიტყვის სიგრძე არის: 
# --> კენტი დაპრინტეთ 'კენტია'
# --> ლუწი დაპრინტეთ 'ლუწია'

sia = ["sdlkfj" "asdkfhgaisdu" "dscsakd" "asduifhi" "sdhfsjf" "bvksdadvc"] 

for i in sia:
    print(len(i))
    if len(i) % 2 == 1:
        print("კენტია")
    elif len(i) % 2 == 0:
        print("ლუწია")

        