# 1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
# შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

sia = [1, 2, 3, 4, 5, 6]

sia[2:4] = [10, 20, 30]

# 2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
# შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].

sia2 = ["apple", "banana", "cherry", "kiwi", "mango"]

sia2[0:2] = ["pear", "plum"]

# 3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
# შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

sia3 = ["a", "b", "c", "d", "e", "f"]

sia3[-3:] = ["x", "y", "z"]

# 4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
# შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

sia4 = ["red", "green", "blue", "yellow", "black", "white"]

sia4[2:5] = ["purple", "orange"]

# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

sia5 = ["გიორგი" , "ირმა" , "საბა" ]
sia5 = ["red", "green", "blue", "yellow", "black", "white"]

# ===========================================

# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".

num = int(input("Enter a number: "))

if num % 2 == 0:
    print("Even")
elif num % 2 == 1:
    print("Odd")

# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"

numbers = [30, 19, 17, 24, 58, 14, 88]

if numbers[3] % 2 == 0:
    print("Even number")
elif numbers[3] % 2 == 1:
    print("Odd number")

# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

numbers2 = [11, 13, 83, 66, 31, 91]

if numbers2[-1] % 2 == 0 and numbers2[-1] > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif numbers2[-1] % 2 == 1 and numbers2[-1] < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")

# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100

sia6 = [10, 16, 48, 97, 33, 804, 511]

if sia6[5] % 2 == 0 or sia6[5] > 100:
    print("even or more than 100")
elif sia6[3] % 2 == 1 or sia6[3] < 100:
    print("odd or less than 100")

# ==============================================================

# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი ოპერატორი != 

str1 = "Wesker"
str2 = "Leviathan"

print(str1 != str2)