# 1)მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც

print(10+11)
print(22+22)
print(33+18)

print(50-31)
print(31-50)
print(11-10)

print(41*8)
print(39*70)
print(33*80)

print(6/2)
print(10/5)
print(40/18)

print(3**2)
print(4**3)
print(10**6)

print(14//7)
print(12//6)
print(50//10)

print(10%5)
print(16%2)
print(50%2)

# 2)კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო

# chven viswavlet //, **, da %, // aris meore ricxvi pirvelshi ramdenjer eteva, ** aris xarisxshi ayvana, da % aris nashti

# 3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ

print(17//4)
print(40//3)
print(80//10)
print(45//6)
print(70//7)

print(4**2)
print(2**3)
print(5**2)
print(10**7)
print(50**2)

print(40%16)
print(10%7)
print(30%4)
print(80%2)
print(16%4)


# 4)ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

#      15 / 3 = 5.0
#      20 / 4 = 5.0
#      100 / 20 = 5.0

#      15 // 10 = 1
#      10 // 7 = 1
#      40 // 12 = 3


#      4 * 3 = 12
#      40 * 3 = 120
#      120 * 3 = 360

#      4 ** 3 = 64
#      10 ** 3 = 1000
#      2 ** 6 = 64
#      3 ** 4 = 81

#      10 % 7 = 3
#      3 % 2 = 1
#      50 % 25 = 0
#      14 % 11 = 3
#      110 % 50 = 10
     
      

# 5)კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან

# siebi imisgan gansxvavdeba cvladebisgan da imistvis viyenebt rom siebshi sheidzleba ramodenime monacemebis chasma, da cvladshi marto ertis sheidzleba

# 6)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები

names = ["lynn" , "jill" , "amanda"]

# 7)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები

numbers = [88 , 14, 31]


# 8)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები

floats = [0.33 , 6.66 , 9.17]

# 9)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები

boollist = [True , False]


# 10)შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი

sia = ["string" , 80 , 1.56 , True]


# ==============   Bonus   ==============

# 11)მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)

num1 = int(input("Enter a number: "))
num2 = int(input("Enter another number: "))

print(num1//num2)

# 12)მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"

num3 = int(input("Enter a number: "))

if num3 > 30 and num3 < 100:
    print("between 30 and 100")
elif num3 > 100 and num3 < 200:
    print("between 100 and 200")
else:
    print("other number")

# 13)შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)

var1 = "pulse"
var2 = 17
var3 = 3.33
var4 = True

print(type(var1))
print(type(var2))
print(type(var3))
print(type(var4))

# 14)while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...

i = 50

while i < 100:
    print(i)
    i = i + 5

# 15)for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...

for i in range(40,90,3):
    print(i)

# 16)გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით

i = 0

while i < 15:
    print("Nicole Shonia")
    i = i + 1

# 17)
# შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# მომხმარებელს შემოატანინეთ სახელი
# თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#       მომხმარებელს შემოატანინე გვარი
#       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#             დაპრინტე --> same name and surname
#       სხვა შემთხვევაში
#             დაპრინტე -- > same name but different surname
# სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#     დაპრინტე --> aqedan moshordi


name = "Nicole"
surname = "Shonia"

urname = input("Enter your first name: ")

if urname == name:
    ursurname = input("Enter your last name: ")
    if ursurname == surname:
        print("same name and surname")
    else:
        print("same name but different surname")
else:
    print("aqedan moshordi!!!")



# HARDER(შეეცადეთ რომ ამოხსნათ თუ ვერ გამოვა შემდედგზე განვიხილავთ,მაინტერესებს დაძლევთ თუარა წესით უნდა გააკეთოთ!!!!!

# 18)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი


pw = "wvthered111"

upw = input("Enter the password: ")

while True:
    if upw == pw:
        print("გამოიცანი")
        break
    else:
        upw = input("Try again: ")

