# 1)კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას

# index aris siashi elementis misamarti da viyenebt imistvis rom siashi ertert monacems mivwvdet, magalitad tu aris sia sadac gvaqvs "g" "k" "c" "z" am siashi 1 index aris "k"

# 2)შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოები

sia = [4 , 6 , 1 , 5, 9, 8 , 4]

sia = [sia[0] + 6 , sia[1] - 4 , sia[2] + 13 , sia[3] + 15 , sia[4] - 5 , sia[5] - 1 , sia[6] + 23]
print(sia)


# 3)შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი

names = ["dwight" , "mikaela" , "carmina" , "sable" , "yui" , "feng" , "adonis" , "herman" , "anna" , "varg"]

print(names[5])
print(names[9])
print(names[3])
print(names[7])
print(names[1])

# 4)შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,თქვენი დავალებაა გომ for loop და while loop (ორივე) ს დახმარებით გამოიტანოთ თთოეული ელემენტი ცალ ცალკე

sia2 = ["purple" , "black" , "grey" , "pink" , "blue" , "red" , "white" ]

for i in range(0,7):
    print(sia2[i])

i = 0
while i < 7:
    print(sia2[i])
    i = i + 1

# 5)შექმენით სია სადაც შეინახავთ 7 ცალ ელემენტს(მონაცემის ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ ამ სიაში შეცვალოთ მე 3 ინდექსზე დმგომი ელემენტი და ჩაანაცვლო "vashli" ით, ასევე შეცვალე მე 6 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე 'msxali' ით ,ასევე შეცვალე მე 4 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე ის 'atami" ით,გამოიტანე საბოლოო სია ტერმინალში,სადაც ეს სალი ელემენტი იქნება განახლებული~

sia3 = [1 , 2 , 3 , 4 , 5 , 6 , 7]

sia3[3] = "vashli" 
sia3[6] = "msxali" 
sia3[4] = "atami"
print(sia3)


# 6)იპოვეთ საბოლოო პასუხი--> True and False or False and True or false and false or true ---> ... true


# 7)შექმენით სია სადაც მოთავსებული გექნებათ ცხოველების სახელები, თქვენი დავალებაა რომ -->  თუ ამ სიაში მოთავსებული მე 3 ინდექსზე მდგომი ელემენტი არის ლომი მაშნ დაპრინტე --> "there is lion on index 3" სხვა შემთხვევაში დაუპრინტე რომ --> "there is no lion on index 3"

cxovelebi = ["cat" , "tiger" , "rabbit" , "lion" , "scorpion" , "bat"]

if cxovelebi[3] == "lion":
    print("there is a lion on index 3")
else:
    print("there is no lion on index 3")

# 8)
# basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

# დაბეჭდეთ კალათის პირველი ხილი.

# დაბეჭდეთ კალათის მესამე ხილი.

# შეცვალეთ მეორე ხილი "ბანანი" სხვა ხილით (თქვენი არჩევანით).

# დაბეჭდეთ თავიდან ბოლომდე ყველა ხილი ცალ–ცალკე, ინდექსების გამოყენებით (არა for-ით).

basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

print(basket[0])
print(basket[2])
basket[1] = "ალუჩა"

print(basket[0])
print(basket[1])
print(basket[2])
print(basket[3])
print(basket[4])


# 9)
# letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# დაბეჭდეთ მესამე ასო.

# დაბეჭდეთ მე–5 და მე–6 ასო.

# დაბეჭდეთ ბოლო ასო.

# ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).

# ააწყეთ სიტყვა "გოლა".

# ააწყვეთ სიტყვა "გოგა"

letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

print(letters[2])
print(letters[4] , letters[5])
print(letters[9])
print(letters[6] + letters[0] + letters[6] + letters[0])
print(letters[2] + letters[3] + letters[4] + letters[5])
print(letters[2] + letters[3] + letters[2] + letters[5])

# 10)
# letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# აიღეთ მე–4 ინდექსზე არსებული ასო და შეინახე ცვლადში

# თუ ეს ასო არის "ლ", დაბეჭდეთ: "სწორია! ასო ლ ა"

# სხვა შემთხვევაში დაბეჭდეთ: "არასწორია, სცადე თავიდან"

# =========================
# აიღეთ ბოლო ასო და შეინახე ცვლადში

# თუ ეს "ე"–ა, დაბეჭდეთ "საიდუმლო სიტყვა იწყება სწორად".

# სხვა შემთხვევაში – "საიდუმლო სიტყვა არასწორია".
# ==========================

# ააწყვეთ სიტყვა "გელა" და შეინახე ცვლადში 

# თუ ცვლადში შენახული სიტყვა "გელა"–ს ტოლია, დაბეჭდეთ "გაარტყი სახელი!"

# სხვა შემთხვევაში – "შტერი ხარ!დ".

letters2 = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

l1 = letters2[4]

if l1 == "ლ":
    print("სწორია! ასო ლ ა")
else:
    print("არასწორია, სცადე თავიდან")

l2 = letters2[9]

if l2 == "ე":
    print("საიდუმლო სიტყვა იწყება სწორად.")
else:
    print("საიდუმლო სიტყვა არასწორია.")

l3 = letters2[2] + letters2[9] + letters2[4] + letters2[5]

if l3 == "გელა":
    print("გაარტყი სახელი!")
else:
    print("შტერი ხარ!")

# 11)შექმენი სია რომელიც იქნება სტრინგებით სავსე,შენი დავალებაა რომ მომხმარებელს შემოატანინო რაიმე რიცხვი,შენი დავალებაა რომ ამ სიიდან გამოიტანო მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი

sia4 = ["xasthur" , "leviathan" , "burzum" , "teitanblood" , "archgoat" , "morbid"]

n = int(input("Enter a number: "))

print(sia4[n])
