# 1)მომხმარებელს შემოატანინეთ ორი რიცხვი,შეამოწმეთ თუ პირველი რიცხვი მეტია მეორე რიცხვზე დაპრინტე რომ ‘first is more than second’,
# ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე დაპრინტე რომ ‘first is less than second’ და სხვა დანარჩენ შემთხვევაში 
# დაპტინტე რომ ‘first number equal to second number’

num1 = int(input("Enter a number: "))
num2 = int(input("Enter another number: "))

if num1 == num2:
    print("The two numbers are equal")
elif num1 > num2:
    print("First number is greater than the second number")
elif num2 > num1:
    print("Second number is greater than the first number")


# 2)მომხმარებელს შემოატანინე რაიმე სტრინგი,ასევე შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს,შემდეგ შეამოწმე თუ მომხმარებლის შემოყვანილი 
# სტრინგი უდრის შენა სახელს დაუპრინტე რომ ‘სეხნიები ვართ’ სხვა შემთხვევაში დაუპრინტეთ რომ ‘სხვადასხვა სახელები გავქვს’

name = input("Enter your name: ")
myname = "Nicole"

if name == myname:
    print("სეხნიები ვართ")
else:
    print("სხვადასხვა სახელები გავქვს")

# 3)შექმენი ორი ცვლადი სადაც შეინახავთ ინტეჯერ ტიპოს მონაცემებს,თქვენი დავალებაა შეამოწმოთ,
# თუ პირველი რიცხვი მეტია 0 ზე და და მეორე რიცხვიც მეტია 0 ზე დაუპრინტე რომ ‘ორივე რიცხვი დადებითია, ასევე შეამოწმე 
# თუ პირველი რიცხვი ნაკლებია 0 ზე და მეორე რიცხვიც ნაკლებია 0 ზე დაპურინტე რომ  ‘ორივე რიცხვი არის უარყოფით’,
# სხვა დანარჩენ შემთხვევაში დაუპრინტე რომ ‘ეს რა ჯანდაბაა’

num3 = 14
num4 = 88

if num3 > 0 and num4 > 0:
    print("ორივე რიცხვი დადებითია")
elif num3 < 0 and num4 < 0:
    print("ორივე რიცხვი არის უარყოფითი")
else:
    print("ეს რა ჯანდაბაა")

# 4)დაატრიალეთ ფორ ლუპი 50 დან 100 მდე 2 ის გამოტივებით 

for i in range(50,100,2):
    print(i)

# 5)ვაილ ლუპის გამოყენებით 20 დან 40 მდე გამოიტანეთ ყველა რიცხვი

i = 20

while i < 40:
    print(i)
    i = i + 1

