# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

name = input("Enter a name: ")

name = name.upper()

print(name)

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

name2 = input("Enter a name with uppercase letters: ")

name2 = name2.lower()

print(name2)

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

name3 = input("Enter a name: ")

name3 = name3.capitalize()

print(name3)

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით

sia = ["fkldsf" , "lkjfsdlkf" , "plksadf" , "adbvmnsd" , "klfdsjkha"]

for i in sia:
    print(i.upper())

# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით

sia2 = ["FDSJKHFP" , "BCMXVNB" , "QWDBSLDJ" , "KVNXXBD" , "QVDFJHSK"]

for i in sia2:
    print(i.lower())

# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს

sia3 = ["tyfdfks" , "bnmbsdmf" , "qwebsnfa" , "mvnclxkc" , "lspdkjflsk"]

for i in sia3:
    print(i.capitalize())

# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

sia4 = ["nvmcnv" , "fjfkdkf" , "qtqtwskd" , "mmcnmxnls"]

print(len(sia4))

# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

al = "ალექსანდრე"

print(len(al))

# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

sia5 = [22, 56, 79, 12, 30, 234, 421, 399, 17, 16]

lw = 0

for i in sia5:
    if i % 2 == 0:
        lw = lw + 1

print(lw)

# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა


sia6 = [300, 15, 614, 3443, 88, 440, 15, 14]

kt = 0

for i in sia6:
    if i % 2 == 1:
        kt = kt + 1

print(kt)

# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("Enter a starting number: "))
end = int(input("Enter the end number: "))
step = int(input("Enter the step: "))

for i in range(start,end,step):
    if i % 2 == 0:
        print(i)