# 1) შემოაყვანიეთ მომხმარებელს რაღაცა სიტყვა:
# -> შეამოწმეთ არის თუ არა 'a' ან 'A' ამ სიტყვაში/ტექსტში
# -> შეამოწმეთ თუ არ არის სიტყვა 'car' ამ სიტყვაში/ტექსტში

word = input("Enter a word: ")

print('a' in word or 'A' in word)
print('car' not in word)



# 2) მომხმარებელს შემოატანინეთ ტექსტი.
# -> დაუარეთ ამ ტექტის ასოებს for ლუპით
# -> თუ ასო არის 'a' ან 'A' დასკიპეთ, სხვა შემთხვევაში დაპრინტეთ ასო

# მაგალითად: შემოიყვანა 'bananA'
# უნდა დაიპრინტოს: 
# b
# n
# n

text = input("Enter something: ")
for i in text:
    if i == "a" or i == "A":
        continue
    print(i)

    