# 1) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება თქენს პირველ სიაში მყოფი მხოლოდ ლუწი რიცხვები. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.

sia = [80 , 11 , 14 , 16 , 90 , 22 , 41]
newsia = []

for i in sia:
    if i % 2 == 0:
        newsia.append(i)
print(newsia)

# 2) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება მხოლოდ თქენს პირველ სიაში კენტ ინდექსზე მდგომი რიცხვები რომელბიც არიან აუცილებლად კენტი. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.

sia2 = [13 , 55 , 60 , 81 , 118 , 161 , 88 , 901 , 177]
newsia2 = []

for i in sia:
    if i % 2 == 1:
        newsia2.append(i)
print(newsia2)

# 3) შექმენით სახელებით სავსე სია და ამ სიიდან ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება ასო გ-თი და მთავრდება ასო ი-თი, გამოიყენეთ for ციკლი, დაწერეთ ორივე ხერხით, pop() ფუნქციითაც და remove() ფუნქციითაც.

sia3 = ["fdsffds" , "afdslkf" , "ifdhjksf" , "gfdjls" , "gldkdfi" , "gcsjki" , "pdskflj" , "gvcscsxi"]
r = []

for i in sia3:
    if i[0] == "g" and i[-1] == "i": 
        sia3.remove(i)
    
print(sia3)

# 4) შექმენით სტრინგებით სავსე სია, და ამ სიიდის ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და რომელიც ამავდროულად დგას კენტ ინდექსზე სიაში, გაუხადეთ ასეთ სიტყვებს ყველა ასო პატარა - lowercase, ხოლო ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და თან ეს სიტყვა დგას ლუწ ინდექსზე სიაში, ამოშალეთ სიიდან. დაპრინტეთ შეცვლილი სია.

sia4 = ["Gdslkf" , "Pfdkshj" , "Cxcvfvj" , "Qfjdhsf" , "Kfdjksh"]

for i in sia4:
    if i == i.capitalize() and i.index() % 2 == 1:
        i.lower()
    elif i == i.capitalize() and i.index() % 2 == 0:
        sia4.remove(i)

# print(sia4)

# 5) შექმენით სიტყვებით სავსე სია, ამ სიიდან ამოშალეთ ყველა სიტყვა რომელიც იწყება Uppercase დიდი ასო G-თი და რომლის ბოლო 2 ასო არის ასევე Uppercase. ხოლო ყველა სიტყვა რომლის თითოეული ასო არის Lowercase-ში, აიყვანეთ Uppercase-ში შესაბამისი სტრინგის ფუნქციის გამოყენებით. დაპრინტეთ მიღებული სია.

sia5 = ["Gfhgk" , "Khgfhg" , "GsxcxnAK" , "Rsdfhc" , "GfkdncVN"]

for i in sia5:
    if i[0] == "G" and i[-2:] == i[-2:].upper():
        sia5[i] = sia5[i].upper()
    elif i == i.lower():
        sia5[i] = i.upper()

print(sia5)

# 6) შექმენით 2 სია, პირველ სიაში იყოს int მონაცემთა ტიპის ელემენტები, ხოლო მეორე სია სავსე იყოს string მონაცემთა ტიპის ელემენტებით. For ციკლის საშუალებით, პირველი სიიდან remove() ფუნქციით ამოშალეთ ყოველი ლუწი რიცხვი რომლებიც დგანან კენტ ინდექსზე, ხოლო მეორე სიიდან pop() ფუნქციით ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება დიდი ასოთი და დგას ლუწ ინდექსზე. ბოლოს შეაერთეთ ორივე შეცვლილი სიები ერთმანეთში, გახადეთ საერთო სია და დაპრინტეთ. (კარგად დააკვირდით პირობას და არ იჩქაროთ. წარმატებები! ! !)

sia6 = [14 , 44 , 74 , 353 , 97 , 181 , 66]
sia7 = ["fldksjf" , "Vcmnxb" , "adsnbc" , "Pdfsk" , "zxcnbv"]

for i in sia6:
    if i % 2 == 0 and i.index() % 2 == 1:
        sia6.remove(i)

for i in sia7:
    if i[0] == i[0].upper and i.index() % 2 == 0:
        sia7.pop(i)

sia6.extend(sia7)

print(sia6)