# 1)კომენტარის სახით ახსენი თუ რომელი ოპერატორები ვისწავლეთ და რა დანიშნულება აქვთ მათ

# 2)მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე,და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს

num1 = input("Enter a number: ")
num2 = input("Enter another number: ")

print(num1>num2)
print(num2>num1)
print(num1 == num2)


# 3)მომხმარებელს შემოატანინეთ 5 სტრინგ ტიპის მნიშვნელობა,შენი დავალებაა მოახდინო მათი კონკატინაცია

str1 = input("String one: ")
str2 = input("String two: ")
str3 = input("String three: ")
str4 = input("String four: ")
str5 = input ("String five: ")

print(str1 + str2 + str3 + str4 + str5 )

# 4)მომხმარებელს შემოატანინე 4 რიცხვი,შენი დავალებაა გაიგო ამ რიცხვების საშუალო არითმეტიკული(დღესაც ვისაუბრეთ ამაზე,ვნახოთ როგორ გაათმევთ თავს)

num1 = input("Enter a number: ")
num2 = input("Enter a number: ")
num3 = input("Enter a number: ")
num4 = input("Enter a number: ")

num1 = int(num1)
num2 = int(num2)
num3 = int(num3)
num4 = int(num4)

print(num1 + num2 + num3 + num4 / 4)

# 5)შექმენი 4 ცვლადი,ამ ცვლადებშ შეინახე 4 განსხვავებული მონაცემთა ტიპის ელემენტები და დაპრინტე მათ ტიპი(გამოიყენეთ შესაბამისი ფუნქცია)

vr1 = "Glass"
vr2 = 88
vr3 = 1.33
vr4 = True

print(type(vr1))
print(type(vr2))
print(type(vr3))
print(type(vr4))



# 6)შექმენი 2 ცვლადი,შეინახე ორივე ცვლადში სტრინგ ტიპის მნიშვნელობები დაშეადარე ისინი არიან თუ არა ერთნაირები(უდრის თ არა ერთმანეთს)

vr5 = "pig"
vr6 = "pig"

print(vr5 == vr6)

# 7)შექმენი 4 ცვლადი,სადაც გექნება მოთავსებული რიცხვები ოღონდ სტრინგის სახით მაგ: "40",გადაიყვანე ეს სტრინგი რიცხვები ინტეჯერში(გამოიყენე შესაბამისი ფუნქცია) და გაიგე ამ ოთხი რიცხვის ჯამი

num5 = "13"
num6 = "17"
num7 = "11"
num8 = "19"

num5 = int(num5)
num6 = int(num6)
num7 = int(num7)
num8 = int(num8)

print(num5 + num6 + num7 + num8)

# 8)შექმენი 3 ცვლადი,ამ ცვლადებში შეინახეთ ინტეჯერ ტიპის მონაცემები,შენი დავალებაა ეს რიცხვები გაასტრინგო(გამოიყენე შესაბამისი ფუნქცია) და გამოიტანო ეს რიცხვები ერთ წინადადებაში. მაგ:304050

num9 = 14
num10 = 15
num11 = 18

num9 = str(num9)
num10 = str(num10)
num11 = str(num11)

print(num9 + num10 + num11)


















