# 1) შექმენით სია სადაც შეინახავთ სხვადასხვა ქალაქების სახელებს.  
#    for loop ით დაბეჭდეთ მხოლოდ ის ქალაქები, რომელთა სახელის სიგრძე მეტია 6-ზე.

sia = ["Kyoto" , "Oslo" , "Lubeck" , "Irkutsk" , "Tbilisi" , "Liege"]

for i in sia:
    if len(i) > 6:
        print(i)

# 2) შექმენით სია სხვადასხვა სიტყვებით.  
# -> for loop-ით დაბეჭდეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე ზუსტად იყოფა 15-ზე.

sia2 = ["sdfjhsdf" , "fudbsorhf" , "odsiods" , "asduyfiogdckdps" , "askdflsl" , "asdpfipm"]

for i in sia2:
    if len(i) % 15 == 0:
        print(i)


# 3) შექმენით სია რიცხვებით.  
# -> გამოიყენეთ for loop რათა დათვალოთ რამდენი რიცხვია სიაში.  
# -> არ გამოიყენოთ len() — დაითვალეთ ხელით.

sia3 = [1161 , 88, 18 , 111111]

for i in sia3:
    print(i)

# 4) შექმენით სია სხვადასხვა სიტყვებით.  
# -> for loop-ით დაბეჭდეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე ზუსტად 5 სიმბოლოა.

sia4 = ["sjhgsajf" , "adfis" , "bcxnbvksd" , "cxkci" , "psdfsaih"]

for i in sia4:
    if len(i) == 5:
        print(i)

# 5) მომხმარებელს შემოატანინე წინადადება.  
# -> გაიგე რამდენი სიმბოლოა წინადადებაში.  
# -> for ციკლით დათვალე რამდენი აso "a" ან "A" არის ტექსტში.

sent = input("Enter a sentence: ")
print(len(sent))



# 6) <= Boss Level =>
# შექმენით სია სადაც შეინახავთ სხვადასხვა სტრინგებს.
# --> დაპრინტეთ ამ სიიდან ყველაზე გრძელი სტრინგი


