# 1)შექმენი სია 7 რიცხვით.

numbers = [10 , 14 , 11 , 88 , 61 , 90 , 13]

# დაბეჭდე პირველი და ბოლო ელემენტების ნამრავლი ისე, რომ ორივეჯერ უარყოფითი ინდექსი გამოიყენო.

print(numbers[-7] * numbers[-1])

# დაბეჭდე მესამე ელემენტი მარცხნიდან და მესამე ელემენტი მარჯვნიდან (უარყოფითიინდექსის გამოყენებით).

print(numbers[2] , numbers[-3])

# 2)შექმენი სია "apple", "banana", "cherry", "grape", "kiwi", "orange".

fr = ["apple", "banana", "cherry", "grape", "kiwi", "orange"]

# დაბეჭდე შუა 2 ელემენტი (ორივე(დადებითი და უარყოფითი)) ინდექსით.

print(fr[2] , fr[3])
print(fr[-3] , fr[-4])

# 3)
# შექმენი [3,4,5,6,7,1,2,9,8,11]

num2 = [3,4,5,6,7,1,2,9,8,11]

# მომხმარებელს შემოატანინე ერთი ინდექსი(რიცხვი) 0 დან 10 მდე.

inp = int(input("Enter a number from 0-10: "))

# თუ მომხმარებლის ინდექსი დადებითია → დაბეჭდე ის ელემენტი
# თუ უარყოფით რიცხვი ან  10 ზე მეტი მაღალირიცხვი შემოიყვანა დაბეჭდეთ --> "you entered negative or more than 10  number "

if inp == 0 or inp > 0:
    print(num2[inp])
elif inp < 0 or inp > 10:
    print("Negative number or greater than 10")


# 4)შექმენით სია ["dog" ," most" ,"is" ,"angry" ,"running"  , "forest", "fast", "in" , "cat" ,"human", "very"]

words = ["dog" ," most" ,"is" ,"angry" ,"running"  , "forest", "fast", "in" , "cat" ,"human", "very"]

# --- მინუს ინდექსების გამოყენებით შეადგინეთ შემდეგი წინადადება და დაბეჭდეთ --> "dog is running in forest very fast"

print(words[-11] , words[-9] , words[-7] , words[-4] , words[-6] , words[-1] , words[-5])

# --- აასწყვეთ ზემოთ მოცემული წინადადება ოღონდ დადებითი ინდექსებით

print(words[0] , words[2] , words[4] , words[7] , words[5] , words[10] , words[6])

# --- დადებით ინდექსების გამოყენებით ააწყვეთ შემდეგი წინადადება ---> "cat is very angry"

print(words[8] , words[2] , words[10] , words[3])

# 5)
# შექმენი სია ცხოველებით: ["dog", "cat", "horse", "cow", "sheep", "goat"].
# მომხმარებელს შემოიტანინე ინდექსი(რიცხვი)

cx = ["dog", "cat", "horse", "cow", "sheep", "goat"]
inp2 = int(input("Enter a number: "))

# თუ მომხმარებლის მიერ შემოყვანილ ინდექსზე მდგომი ელემენტი არის  "cat", დაბეჭდე "შენ აირჩიე კატა".

# თუ არის "goat", დაბეჭდე "შენ აირჩიე თხა".

# სხვა შემთხვევაში დაბეჭდე "სხვა ცხოველი აირჩიე".

if inp2  == 1:
    print("შენ აირჩიე კატა")
elif inp2 == 5:
    print("შენ აირჩიე თხა")
else:
    print("სხვა ცხოველი აირჩიე")

# 6)
# შექმენი სია 6 ქალაქით.
# მომხმარებელი შემოიტანს ორ ინდექსს(რიცხვს).

# თუ პირველი ინდექსი ნაკლებია მეორეზე → დაბეჭდე ამ ინდექსებზე მდგომი ორივე ელემენტი.

# თუ მეორე ნაკლებია პირველზე → დაბეჭდე "შეცვალე ინდექსები ადგილებით"--->ზემოთ თუ დაპრინტე a და b ამ შემთხვევაში დაპრინტე b და a.

# თუ ინდექსები ერთნაირია → დაბეჭდე "ორივე ერთია" და გამოიტანე ამ ინდექსზე მდგომი ელემენტი ვთქვათ თუ შემოიყვანა მომხმარებელმა 5 და 5 დაუბეჭდე მე 5 ინდექსზე მდგომი ელემენტი.


cities = ["berlin" , "munich" , "lubeck" , "oslo" , "bergen" , "trondheim"]
inp3 = int(input("Enter a number: "))
inp4 = int(input("Enter another number: "))

if inp3 < inp4:
    print(cities[inp3] , cities[inp4])
elif inp3 > inp4:
    print("შეცვალე ინდექსები ადგილებით" , cities(inp4) , cities[inp3])


# 7)მომხმარებელი შემოიტანს სიტყვას.

word = input("Enter a word: ")

# თუ პირველი ასო "a"-ა → დაბეჭდე "სიტყვა იწყება a-თი".

# თუ ბოლო ასო "z"-ია → დაბეჭდე "სიტყვა მთავრდება z-ით".

# სხვაგვარად → დაბეჭდე "სიტყვა არც a-თი იწყება და არც z-ით მთავრდება".

if word[0] == "a":
    print("სიტყვა იწყება a-თი")
elif word[-1] == "z":
    print("სიტყვა მთავრდება z-ით")
else:
    print("სიტყვა არც a-თი იწყება და არც z-ით მთავრდება")

# 8)დავალება 4

# მომხმარებელი შემოიტანს სიტყვას.

# თუ პირველი და ბოლო ასო ერთმანეთს ემთხვევა → დაბეჭდე "პირველი და ბოლო ერთნაირია".

# თუ განსხვავდება → "პირველი და ბოლო განსხვავებულია".

word2 = input("Enter a word: ")
if word2[0] == word2[-1]:
    print("პირველი და ბოლო ერთნაირია")
else:
    print("პირველი და ბოლო განსხვავებულია")


# 9)შექმენი ცვლადი სადაც შეინახავთ შემდეგ ასოებს ---> "agivorsbgitr"
 
letters = "agivorsbgitr"

# ----ამ სიიდან შეადგინე სიტყვა "goga, 

print(letters[1] + letters[4] + letters[1] + letters[0])

# ----ამ სიტყვიდან შეადგინე სიტყვა "saba"

print(letters[6] + letters[0] + letters[7] + letters[0])

# ----ამ სიტყვიდან შეადგინე სიტყვა "bativar"

print(letters[-5] + letters[0] + letters[-2] + letters[-3] + letters[3] + letters[0] + letters[-1])


# 10)შექმენი შემდეგი სტრინგი --> 'giorgi'

saxeli = "giorgi"

# შენი დავალებააა რომ for დდა while loop ის დახმარებით გამოიტანო ამ სტრინგის თითეული ასო ცალ ცალკე

for i in range(0,6):
    print(saxeli[i])


i = 0
while i < 0:
    print(saxeli[i])
    i = i + 1


# 11)გადახედეთ რესურსებს!!!!!!!!!!!!!!!!!!!!!
