 
# 1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
# --> გამოიტანეთ პირველი 5 ელემენტი
# --> გამოიტანეთ ბოლო 3 ელემენტი
# --> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით

sia = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10]

print(sia[:5])
print(sia[7:10])
print(sia[3:8])

# 2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
# --> გამოიტანეთ პირველი 6 ელემენტი
# --> გამოიტანეთ ბოლო 10 ელემენტი
# --> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)

sia2 = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 , 11 , 12 , 13 , 14 , 15]
print(sia2[:-9])
print(sia2[-10:])
print(sia2[-8:-1])


# 3) მოცემულია სიტვა 'თვითმფრინავი'
# გამოიტანეთ 'ნავი'

word = "თვითმფრინავი"
print(word[8:12])

# 4) მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
# --> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით

word2 = "Programmer"
print(word2[0:3])
print(word2[0:-7])

# 5) შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:

week = ["Monday" , "Tuesday" , "Wednesday" , "Thursday" , "Friday" , "Saturday" , "Sunday"]

# --> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)

print(week[:5])
print(week[:-2])

# --> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)

print(week[5:])
print(week[-2:])



# 6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->

sentence = "Python slicing is very powerful"

# გამოიტანეთ: 
# 'Python'
# 'slicing'
# 'powerful'

print(sentence[:6])
print(sentence[7:14])
print(sentence[23:])

# გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები

print(sentence[:-24])
print(sentence[-24:-16])
print(sentence[-8:])